package org.btkj.pojo.enums;

/**
 * 车辆种类详细(仅限特种车)
 * 
 * @author ahab
 */
public enum VehicleTypeDetailCode {

	/**
	 * 集装箱车头
	 */
	V3401,
	
	/**
	 * 油罐车
	 */
	V3101,
	
	/**
	 * 汽罐车
	 */
	V3102,
	
	/**
	 * 液罐车
	 */
	V3103,
	
	/**
	 * 清障车
	 */
	V3201,
	
	/**
	 * 清扫车
	 */
	V3202,
	
	/**
	 * 清洁车
	 */
	V3203,
	
	/**
	 * 起重机
	 */
	V3204,
	
	/**
	 * 装卸车（不含自卸车）
	 */
	V3205,
	
	/**
	 * 升降机
	 */
	V3206,
	
	/**
	 * 搅拌车
	 */
	V3207,
	
	/**
	 * 挖掘机
	 */
	V3208,
	
	/**
	 * 水泥泵车
	 */
	V3209,
	
	/**
	 * 推土机
	 */
	V3210,
	
	/**
	 * 其他工程类轮式车辆
	 */
	V3212,
	
	/**
	 * 冷藏车
	 */
	V3213,
	
	/**
	 * 保温车
	 */
	V3214,
	
	/**
	 * 冷藏、保温挂车
	 */
	V3215,
	
	/**
	 * 压路车
	 */
	V3216,
	
	/**
	 * 矿山车
	 */
	V3217,
	
	/**
	 * 油汽田操作用车
	 */
	V3218,
	
	/**
	 * 罐式挂车(除油罐、汽罐、液罐之外的)
	 */
	V3219,
	
	/**
	 * 净水车
	 */
	V3220,
	
	/**
	 * 其它
	 */
	V3301,
	
	/**
	 * 电视转播车
	 */
	V3302,
	
	/**
	 * 消防车
	 */
	V3303,
	
	/**
	 * 医疗车
	 */
	V3304,
	
	/**
	 * 救护车
	 */
	V3305,
	
	/**
	 * 监测车
	 */
	V3306,
	
	/**
	 * 雷达车
	 */
	V3307,
	
	/**
	 * X光检查车
	 */
	V3308,
	
	/**
	 * 电信工程车
	 */
	V3309,
	
	/**
	 * 电力工程车
	 */
	V3310,
	
	/**
	 * 专业拖车
	 */
	V3311,
	
	/**
	 * 邮电车
	 */
	V3312,
	
	/**
	 * 运钞车
	 */
	V3313,
	
	/**
	 * 警用车
	 */
	V3314,
	
	/**
	 * 仪器设备挂车
	 */
	V3315;
}
